; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-4-5-4)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	s0 - location
	s1 - location
	s2 - location
	p1-0 - location
	p1-2 - location
	p2-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s1)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at package1 s1)
	(at package2 s2)
	(at package3 s2)
	(at package4 s0)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(= (time-to-walk s1 p1-0) 14)
	(= (time-to-walk p1-0 s1) 14)
	(= (time-to-walk s0 p1-0) 67)
	(= (time-to-walk p1-0 s0) 67)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 67)
	(= (time-to-walk p1-2 s1) 67)
	(= (time-to-walk s2 p1-2) 70)
	(= (time-to-walk p1-2 s2) 70)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 83)
	(= (time-to-walk p2-0 s2) 83)
	(= (time-to-walk s0 p2-0) 44)
	(= (time-to-walk p2-0 s0) 44)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 2)
	(= (time-to-drive s1 s0) 2)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 30)
	(= (time-to-drive s2 s1) 30)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 91)
	(= (time-to-drive s0 s2) 91)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver4 s0)
	(at truck1 s2)
	(at truck2 s1)
	(at truck3 s2)
	(at truck4 s1)
	(at truck5 s1)
	(at package1 s2)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	))

(:metric minimize (+ (+ (* 4  (total-time)) (* 1  (driven))) (* 4  (walked))))

)

; plan
1. (board-truck driver1 truck1 s0)
   deleted: (at driver1 s0) (empty truck1)
   added: (driving driver1 truck1)
   goals met: 5 of 10
2. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 0 to 91
   goals met: 6 of 10
3. (board-truck driver2 truck5 s2)
   deleted: (at driver2 s2) (empty truck5)
   added: (driving driver2 truck5)
   goals met: 6 of 10
4. (load-truck package2 truck1 s2)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 6 of 10
5. (drive-truck truck5 s2 s1 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   changed: (driven) from 91 to 121
   goals met: 7 of 10
6. (load-truck package1 truck5 s1)
   deleted: (at package1 s1)
   added: (in package1 truck5)
   goals met: 7 of 10
7. (drive-truck truck5 s1 s2 driver2)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   changed: (driven) from 121 to 151
   goals met: 6 of 10
8. (unload-truck package1 truck5 s2)
   deleted: (in package1 truck5)
   added: (at package1 s2)
   goals met: 7 of 10
9. (drive-truck truck5 s2 s0 driver2)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   changed: (driven) from 151 to 242
   goals met: 7 of 10
10. (load-truck package4 truck5 s0)
   deleted: (at package4 s0)
   added: (in package4 truck5)
   goals met: 7 of 10
11. (drive-truck truck5 s0 s1 driver2)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   changed: (driven) from 242 to 244
   goals met: 8 of 10
12. (unload-truck package4 truck5 s1)
   deleted: (in package4 truck5)
   added: (at package4 s1)
   goals met: 9 of 10
13. (drive-truck truck1 s2 s0 driver1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   changed: (driven) from 244 to 335
   goals met: 8 of 10
14. (unload-truck package2 truck1 s0)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 9 of 10
15. (drive-truck truck1 s0 s2 driver1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   changed: (driven) from 335 to 426
   goals met: 10 of 10
